// Створити масив з трьох чисел. Змінити значення другого елемента масиву на 10. 🔽

let arr1 = [1, 2, 3];
arr1[1] = 10;
console.log(arr1);

// Створити масив із трьох рядків. Додати до масиву ще одну рядків.🔽

let arr2 = [1, 2, 3];
arr2[arr2.length] = 4;
console.log(arr2);

// Створити скрипт який поверне суму всіх чисел в масиві. 🔽

let arr3 = [1, 2, 3, 4, 5];
let sumaArr3 = 0;
for (let i = 0; i < arr3.length; i++) {
  sumaArr3 += arr3[i];
}
console.log(sumaArr3);

// Створити масив з 5-ти чисел. Вивести на екран всі елементи масиву за допомогою циклу for. 🔽

let arr4 = [1, 2, 3, 4, 5];
for(let i = 0; i < arr4.length; i++) {
    console.log(arr4[i])
}

// Створити масив із 5-ти рядків. Вивести на екран кожен рядокз масиву, який містить більше 5-ти символів. 🔽

let arr5 = [
  "Яблуко", // 6 
  "Кіт", // 3 
  "Собака", // 6 
  "Зірка", // 5
  "Айті" // 4
];

for (let i = 0; i < arr5.length; i++) {
  if (arr5[i].length >= 5) {
      console.log(arr5[i]);
  }
}


// Створити масив з 10-ти чисел. Знайти та вивести на екран максимальне значення з масиву. 🔽
const arr6 = [51, 18, 13, 24, 7, 85, 19];
let smallestNumber = arr6[0];

for (let num of arr6) {
  if (arr6 < smallestNumber) {
    smallestNumber = arr6;
  }
}

console.log(`Найменше число: ${smallestNumber}`); // 7

// Створити масив з 10-ти чисел. Знайти всі парні числа в масиві та вивести їх на екран. 🔽

let arr7 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for(let i = 0; i < arr7.length; i ++){
    if(arr7[i] % 2 === 0){
        console.log(arr7[i])
    }
}